benchmark/results/aquilia/stream/run3.txt
Running 30s test @ http://127.0.0.1:8084/stream
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.10s   432.14ms   1.99s    59.83%
    Req/Sec     6.48      5.25    40.00     80.88%
  Latency Distribution
     50%    1.10s 
     75%    1.39s 
     90%    1.74s 
     99%    1.97s 
  471 requests in 30.07s, 4.83GB read
  Socket errors: connect 0, read 0, write 0, timeout 232
Requests/sec:     15.66
Transfer/sec:    164.64MB